In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('cenus.csv')

In [3]:
df.head()

,Age,Workclass,fnlwgt,Education,Education_Num,Martial_Status,Occupation,Relationship,Race,Sex,Capital_Gain,Capital_Loss,Hours_per_week,Country,Target
0,39,State_gov,77516,Bachelors,13,Never_married,Adm_clerical,Not_in_family,White,Male,2174,0,40,United_States,<=50K
1,50,Self_emp_not_inc,83311,Bachelors,13,Married_civ_spouse,Exec_managerial,Husband,White,Male,0,0,13,United_States,<=50K
2,38,Private,215646,HS_grad,9,Divorced,Handlers_cleaners,Not_in_family,White,Male,0,0,40,United_States,<=50K
3,53,Private,234721,11th,7,Married_civ_spouse,Handlers_cleaners,Husband,Black,Male,0,0,40,United_States,<=50K
4,28,Private,338409,Bachelors,13,Married_civ_spouse,Prof_specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
df.shape

(30162, 15)

In [5]:
df.dropna(inplace = True)

In [6]:
df.shape

(30162, 15)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30162 entries, 0 to 30161
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             30162 non-null  int64
 1   Workclass       30162 non-null  object
 2   fnlwgt          30162 non-null  int64
 3   Education       30162 non-null  object
 4   Education_Num   30162 non-null  int64
 5   Martial_Status  30162 non-null  object
 6   Occupation      30162 non-null  object
 7   Relationship    30162 non-null  object
 8   Race            30162 non-null  object
 9   Sex             30162 non-null  object
 10  Capital_Gain    30162 non-null  int64
 11  Capital_Loss    30162 non-null  int64
 12  Hours_per_week  30162 non-null  int64
 13  Country         30162 non-null  object
 14  Target          30162 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.5+ MB

# Checking the value counts

In [8]:
df.columns

Index(['Age', 'Workclass', 'fnlwgt', 'Education', 'Education_Num',
       'Martial_Status', 'Occupation', 'Relationship', 'Race', 'Sex',
       'Capital_Gain', 'Capital_Loss', 'Hours_per_week', 'Country', 'Target'],
      dtype='object')

In [9]:
df['Target'].unique()

array([' <=50K', ' >50K'], dtype=object)

In [10]:
df['Target'] = df['Target'].map({' <=50K' :'Rich' , ' >50K' :'Poor'} )

In [11]:
df.head()

,Age,Workclass,fnlwgt,Education,Education_Num,Martial_Status,Occupation,Relationship,Race,Sex,Capital_Gain,Capital_Loss,Hours_per_week,Country,Target
0,39,State_gov,77516,Bachelors,13,Never_married,Adm_clerical,Not_in_family,White,Male,2174,0,40,United_States,Rich
1,50,Self_emp_not_inc,83311,Bachelors,13,Married_civ_spouse,Exec_managerial,Husband,White,Male,0,0,13,United_States,Rich
2,38,Private,215646,HS_grad,9,Divorced,Handlers_cleaners,Not_in_family,White,Male,0,0,40,United_States,Rich
3,53,Private,234721,11th,7,Married_civ_spouse,Handlers_cleaners,Husband,Black,Male,0,0,40,United_States,Rich
4,28,Private,338409,Bachelors,13,Married_civ_spouse,Prof_specialty,Wife,Black,Female,0,0,40,Cuba,Rich

In [12]:
df['Country'].unique()

array([' United_States', ' Cuba', ' Jamaica', ' India', ' Mexico',
       ' Puerto_Rico', ' Honduras', ' England', ' Canada', ' Germany',
       ' Iran', ' Philippines', ' Poland', ' Columbia', ' Cambodia',
       ' Thailand', ' Ecuador', ' Laos', ' Taiwan', ' Haiti', ' Portugal',
       ' Dominican_Republic', ' El_Salvador', ' France', ' Guatemala',
       ' Italy', ' China', ' South', ' Japan', ' Yugoslavia', ' Peru',
       ' Outlying_US_Guam_USVI_etc', ' Scotland', ' Trinadad_Tobago',
       ' Greece', ' Nicaragua', ' Vietnam', ' Hong', ' Ireland',
       ' Hungary', ' Holand_Netherlands'], dtype=object)

In [13]:
df['Workclass'] = df['Workclass'].str.replace(' ' , '')
df['Education'] = df['Education'].str.replace(' ' , '')
df['Martial_Status'] = df['Martial_Status'].str.replace(' ' , '')
df['Occupation'] = df['Occupation'].str.replace(' ' , '')
df['Relationship'] = df['Relationship'].str.replace(' ' , '')
df['Race'] = df['Race'].str.replace(' ' , '')
df['Sex'] = df['Sex'].str.replace(' ' , '')
df['Country'] = df['Country'].str.replace(' ' , '')

In [14]:
new_df = df.copy()

In [15]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30162 entries, 0 to 30161
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             30162 non-null  int64
 1   Workclass       30162 non-null  object
 2   fnlwgt          30162 non-null  int64
 3   Education       30162 non-null  object
 4   Education_Num   30162 non-null  int64
 5   Martial_Status  30162 non-null  object
 6   Occupation      30162 non-null  object
 7   Relationship    30162 non-null  object
 8   Race            30162 non-null  object
 9   Sex             30162 non-null  object
 10  Capital_Gain    30162 non-null  int64
 11  Capital_Loss    30162 non-null  int64
 12  Hours_per_week  30162 non-null  int64
 13  Country         30162 non-null  object
 14  Target          30162 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.5+ MB

In [16]:
new_df.isnull().sum()

Age               0
Workclass         0
fnlwgt            0
Education         0
Education_Num     0
Martial_Status    0
Occupation        0
Relationship      0
Race              0
Sex               0
Capital_Gain      0
Capital_Loss      0
Hours_per_week    0
Country           0
Target            0
dtype: int64

In [17]:
new_df.head()

,Age,Workclass,fnlwgt,Education,Education_Num,Martial_Status,Occupation,Relationship,Race,Sex,Capital_Gain,Capital_Loss,Hours_per_week,Country,Target
0,39,State_gov,77516,Bachelors,13,Never_married,Adm_clerical,Not_in_family,White,Male,2174,0,40,United_States,Rich
1,50,Self_emp_not_inc,83311,Bachelors,13,Married_civ_spouse,Exec_managerial,Husband,White,Male,0,0,13,United_States,Rich
2,38,Private,215646,HS_grad,9,Divorced,Handlers_cleaners,Not_in_family,White,Male,0,0,40,United_States,Rich
3,53,Private,234721,11th,7,Married_civ_spouse,Handlers_cleaners,Husband,Black,Male,0,0,40,United_States,Rich
4,28,Private,338409,Bachelors,13,Married_civ_spouse,Prof_specialty,Wife,Black,Female,0,0,40,Cuba,Rich

In [18]:
new_df.to_csv('model.csv' , index = False)